import codecs
codecs.BOM_UTF8.decode()

data = codecs.open(file, 'r')
print(data.read())'''


"""
1. Создать программно файл в текстовом формате,
 записать в него построчно данные, вводимые пользователем.
 Об окончании ввода данных свидетельствует пустая строка.
"""
#new_file_name = 'new_file.txt'
#new_file = open(new_file_name, 'w', encoding='utf8')
'''
print
