from types import FunctionType
a = (x for x in [1])
print(type(a))
print(a)

#Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользоват
